000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОтложенныеПроцессы/ОтложенныеПроцессы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтложенныеПроцессы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ИмяПроцесса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <comment>Используется как флаг &quot;уже обрабатывался&quot; данным процессом</comment>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеПроцесса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИнтервалВыполнения</name>
    <comment>Количество секунд, через которое можно повторно выполнить невыполненный процесс</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследнееВыполнение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОтложенныеПроцессы/ManagerModule.bsl
//	LNK 17.09.2016 09:02:48
Процедура НазначитьОтложенныйПроцесс(Знач ИмяПроцесса, Параметры, ОписаниеКоманды, ИнтервалВыполнения = 0, ОбновитьЕслиСуществует = Истина)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ИмяПроцесса = ВРег(СокрЛП(ИмяПроцесса));
	Период      = ТекущаяДата();

	Если ОбновитьЕслиСуществует Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТаблицаРегистра.Период КАК Период
		|ИЗ
		|	РегистрСведений.ОтложенныеПроцессы КАК ТаблицаРегистра
		|ГДЕ
		|	ТаблицаРегистра.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|	И ТаблицаРегистра.ИмяПроцесса = &ИмяПроцесса
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период"
		);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Запрос.УстановитьПараметр("ИмяПроцесса", ИмяПроцесса);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда

			Период = Выборка.Период;

		КонецЕсли;

	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.ОтложенныеПроцессы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период         = Период;
	МенеджерЗаписи.ИмяПроцесса    = ИмяПроцесса;
	МенеджерЗаписи.ДанныеПроцесса = Новый ХранилищеЗначения(Новый Структура(
		"Параметры, ОписаниеКоманды"
		, Параметры, ОписаниеКоманды));
	МенеджерЗаписи.ИнтервалВыполнения = ИнтервалВыполнения;

	МенеджерЗаписи.Записать(Истина);

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры
